megahallon/stm32hub75/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdbool.h>

#include "framebuffer.h"
#include "testimage.h"
#include "matrix.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

char debug[256];
#define UART_SIZE 1024
uint8_t uart_buf[UART_SIZE];
uint8_t uart_lock = 0;
uint16_t uart_len = 0;
uint16_t uart_read = 0;
uint16_t uart_write = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

#define MIN(a,b) (((a)<(b))?(a):(b))

void send_debug(const char *str)
{
	HAL_UART_Transmit(&huart1, (unsigned char*)str, strlen(str), 1000);
}

void UART_IRQHandler(UART_HandleTypeDef *huart)
{
	uint32_t isrflags = huart->Instance->SR;

	if (isrflags & USART_SR_RXNE) {
		*(uart_buf + uart_write) = huart->Instance->DR;
		uart_write = (uart_write + 1) & (UART_SIZE - 1);
		++uart_len;
    return;
  }

  /* noise error */
  if (isrflags & USART_SR_NE) {
    huart->ErrorCode |= HAL_UART_ERROR_NE;
  }

  /* frame error */
  if (isrflags & USART_SR_FE) {
    huart->ErrorCode |= HAL_UART_ERROR_FE;
  }

  /* over-run */
  if (isrflags & USART_SR_ORE) { 
    huart->ErrorCode |= HAL_UART_ERROR_ORE;
  }
}

uint16_t uart_get(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	uint16_t count;
	uint16_t got = 0;
	
	if (uart_len) {
		count = MIN(uart_len, Size);
		memcpy(pData, uart_buf + uart_read, count);
		uart_read = (uart_read + count) & (UART_SIZE - 1);
    __HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);
		uart_len -= count;
    __HAL_UART_ENABLE_IT(huart, UART_IT_RXNE);
		Size -= count;
		got += count;
	}
	
	if (Size == 0 || Timeout == 0)
		return got;

  uint32_t tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < Timeout) {
		if (uart_len) {
			count = MIN(uart_len, Size);
			memcpy(pData + got, uart_buf + uart_read, count);
			uart_read = (uart_read + count) & (UART_SIZE - 1);
			__HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);
			uart_len -= count;
			__HAL_UART_ENABLE_IT(huart, UART_IT_RXNE);
			Size -= count;
			got += count;
			if (Size == 0) break;
		}
	}
	
	return got;
}

uint16_t UART_Receive_Until(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size, uint32_t Timeout,
														const char* until)
{
  uint32_t tickstart = 0;
	uint16_t count = 0;
	uint16_t left = Size;
	uint8_t data;
	uint8_t until_len = 0;
	if (until)
		until_len = strlen(until);
	uint8_t* cmp = pData - until_len;
	
  tickstart = HAL_GetTick();
  while (left && (HAL_GetTick() - tickstart) < Timeout) {
		if (uart_get(huart, &data, 1, 0) == 1) {
			--left;
			++count;
			*pData++ = data;
			++cmp;
			if (until_len && count >= until_len && *cmp == *until &&
					memcmp(until, cmp, until_len) == 0) {
				break;
			}
		}
  }
  return count;
}

int UART_Receive_ParseInt(UART_HandleTypeDef *huart, uint32_t Timeout)
{
  uint32_t tickstart = 0;
	uint8_t data;
	int out = 0;
	int state = 0;
	
  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < Timeout) {
		if (uart_get(huart, &data, 1, 0) == 1) {
			if (state == 0 && data >= '0' && data <= '9')
				state = 1;
			if (state == 1) {
				if (data < '0' || data > '9')
					break;
				out *= 10;
				out += data - '0';
			}
		}
  }
  return out;
}

uint16_t UART_Receive(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	return UART_Receive_Until(huart, pData, Size, Timeout, NULL);
}

void send_wifi(const char *str)
{
	HAL_UART_Transmit(&huart2, (unsigned char*)str, strlen(str), 1000);
}

void wifi_command(const char *str, const char *until)
{
	char response[256];
	send_wifi(str);
	sprintf(debug, "send wifi %s\r\n", str);
	send_debug(debug);
	
	int l = UART_Receive_Until(&huart2, (unsigned char*)response, 256, 5000, until);
	response[l] = 0;
	sprintf(debug, "got response %d %s\r\n", l, response);
	send_debug(debug);
}

void wifi_command_ok(const char *str)
{
	wifi_command(str, "OK\r\n");
}

void check_wifi_connection() {
	char data[512];
	if (uart_len) {
		uint16_t l = UART_Receive_Until(&huart2, (unsigned char*)data, 256, 10, "+IPD");
		data[l] = 0;
		if (strncmp(data + l - 4, "+IPD", 4) == 0) {
			int connection = UART_Receive_ParseInt(&huart2, 1000);
			int len = UART_Receive_ParseInt(&huart2, 1000);

			sprintf(data, "got connection %d\r\n", connection);
			send_debug(data);

			l = uart_get(&huart2, (unsigned char*)data, len, 10000);
			
			char message[32];
			static int xx = 0;
			sprintf(message, "<h1>HELLO %d<h1>", xx++);
			
			sprintf(data, "AT+CIPSEND=%d,%d\r\n", connection, strlen(message));
			wifi_command_ok(data);
						
			UART_Receive_Until(&huart2, (unsigned char*)data, 100, 5000, ">");
			send_wifi(message);

			UART_Receive_Until(&huart2, (unsigned char*)data, 100, 5000, "SEND OK");

			sprintf(data, "AT+CIPCLOSE=%d\r\n", connection);
			wifi_command_ok(data);
		}
	}
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_I2C1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */

  __HAL_UART_ENABLE_IT(&huart2, UART_IT_ERR);
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
	
	wifi_command("AT+RST\r\n", "ready\r\n"); 
	wifi_command_ok("AT+GMR\r\n");
	wifi_command_ok("AT+CWMODE=3\r\n");
	wifi_command_ok("AT+CWJAP=\"hallonsaft\",\"apakattmus\"\r\n");
	wifi_command_ok("AT+CIFSR\r\n");
	wifi_command_ok("AT+CIPMUX=1\r\n");
	wifi_command_ok("AT+CIPSERVER=1,80\r\n");

	framebuffer_init();
	matrix_init();
	testimage_init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV2;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* I2C1 init function */
static void MX_I2C1_Init(void)
{

  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* TIM2 init function */
static void MX_TIM2_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 0;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 0;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 9600;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_10 
                          |GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14 
                          |GPIO_PIN_15|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5 
                          |GPIO_PIN_8|GPIO_PIN_9, GPIO_PIN_RESET);

  /*Configure GPIO pins : PB0 PB1 PB2 PB10 
                           PB11 PB12 PB13 PB14 
                           PB15 PB3 PB4 PB5 
                           PB8 PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_10 
                          |GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14 
                          |GPIO_PIN_15|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5 
                          |GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
